Revit 2027 API
TriangleInShellComponent Properties
The TriangleInShellComponent type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
VertexIndex0 |  Index of the triangle's first vertex in the TriangulatedShellComponent's array of vertices.
VertexIndex1 |  Index of the triangle's second vertex in the TriangulatedShellComponent's array of vertices.
VertexIndex2 |  Index of the triangle's third vertex in the TriangulatedShellComponent's array of vertices.
Top
See Also
Reference
TriangleInShellComponent Class
Autodesk.Revit.DB Namespace